ednieuw/NanoESP32-BW-RGBW-clock/ESP32WordClockUltimatePCB_V032/ESP32WordClockUltimatePCB_V032.ino
//--------------------------------------------
// ESP32 Includes defines and initialisations
//--------------------------------------------

#include <Preferences.h>
#include <RTClib.h>            // Used for connected DS3231 RTC // Reference https://adafruit.github.io/RTClib/html/class_r_t_c___d_s3231.html
                      #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
#include "EdSoftLED.h"         // https://github.com/ednieuw/EdSoftLED for LED strip WS2812 or SK6812. Uses RMT driver
                      #else
#include <Adafruit_NeoPixel.h> // https://github.com/adafruit/Adafruit_NeoPixel  for LED strip WS2812 or SK6812
                      #endif
#include <NimBLEDevice.h>      // For BLE communication !!!Use NimBLE version 2.x.x https://github.com/h2zero/NimBLE-Arduino
#include <ESPNtpClient.h>      // https://github.com/gmag11/ESPNtpClient
#include <WiFi.h>              // Used for web page 
#include <AsyncTCP.h>          // Used for webpage  https://github.com/dvarrel/AsyncTCP                    old https://github.com/me-no-dev/ESPAsyncWebServer
#include <ESPAsyncWebServer.h> // Used for webpage  https://github.com/mathieucarbou/ESPAsyncWebServer     Old one with  https://github.com/me-no-dev/ESPAsyncWebServer
#include <ElegantOTA.h>        // If a large bunch of compile error see here :https://docs.elegantota.pro/async-mode
                               // Locate the ELEGANTOTA_USE_ASYNC_WEBSERVER macro in the ElegantOTA.h file, and set it to 1:
                               // #define ELEGANTOTA_USE_ASYNC_WEBSERVER 1
#include <ESPmDNS.h>           // To show BLEname in router
#include <DNSServer.h>         // For the web page to enter SSID and password of the WIFI router 
#include <Wire.h>              // Used for I2C 
#include <Encoder.h>           // For rotary encoder
#include <Keypad.h>            // For 3x1 membrane keypad instead of rotary encoder by Mark Stanley & Alexander Brevig 

                      #ifdef DCF77MOD
#include <DCF77.h>
#include <TimeLib.h>
                      #endif //DCF77MOD

                      #if defined(FOURLANGUAGECLOCK) || defined(NL144CLOCK) || defined( NLM1M2M3M4L94)
#define RGBCLOCK
                      #endif
                      #if defined(NLBW) || defined(UKBW)  || defined(UVBW)  
#define BWCLOCK
                      #endif
//--------------------------------------------
// SPIFFS storage
//--------------------------------------------
Preferences FLASHSTOR;

//--------------------------------------------
// COLOURS stored in Mem.DisplayChoice
//--------------------------------------------   
const byte DEFAULTCOLOUR = 0;
const byte HOURLYCOLOUR  = 1;          
const byte WHITECOLOR    = 2;
const byte OWNCOLOUR     = 3;
const byte OWNHETISCLR   = 4;
const byte WHEELCOLOR    = 5;
const byte DIGITAL       = 6;
const byte ANALOOG       = 7;

//------------------------------------------------------------------------------
// PIN Assigments for Arduino Nano ESP32
//------------------------------------------------------------------------------ 
 
enum DigitalPinAssignments {      // Digital hardware constants
 SERRX        = D0,               // D0 Connects to TX
 SERTX        = D1,               // D1 Connects to RX
 encoderPinB  = D2,               // D2 left (labeled CLK on decoder)no interrupt pin  
 encoderPinA  = D3,               // D3 right (labeled DT on decoder)on interrupt  pin
 clearButton  = D4,               // D4 switch (labeled SW on decoder)
 LED_PIN      = D5,               // D5 Pin to control colour SK6812/WS2812 LEDs
 PIN_D6       = D6,               // D6 To Level shifter 74AHCT125 when Connected
 PIN_D7       = D7,               // D7 To Level shifter 74AHCT125 when Connected
 DCF_PIN      = D8,               // D8 DCF pin
 DCF_LED_Pin  = D9,               // D9 Optional for DCF_LED 
 Empty        = D9,               // Empty on PCB ESP32 Word clock V003
 PCB_LED_D10  = D10,              // D10 Right LED on PCB ESP32 Word clock V003
 PIN_D11      = D11,              // D11 Connector on PCB
 PCB_LED_D12  = D12,              // D12 Left LEDon PCB ESP32 Word clock V003
 secondsPin   = D13,              // D13 GPIO48 Right LED on PCB V001 & V002 (#ifdef LED_BUILTIN  #undef LED_BUILTIN #define LED_BUILTIN 48 #endif)
 Nano_LED_D13 = D13               // D13 GPIO48 
 };
 
enum AnaloguePinAssignments {     // Analogue hardware constants ----
 LEDDataPin   = A0,               // HC595      D17
 LEDStrobePin = A1,               // HC595      D18
 LEDClockPin  = A2,               // HC595      D19
 OneWirePin   = A3,               // OneWirePin D20
 SDA_pin      = A4,               // SDA pin    D21
 SCL_pin      = A5,               // SCL pin    D22
 PhotoCellPin = A6,               // LDR pin    D23
 PWMpin       = A7                // Pin that controls PWM signal on BC327 transistor to dim light D24
};
//--------------------------------------------                                                //
const uint32_t black    = 0x000000, darkorange    = 0xFF8C00, red        = 0xFF0000, chartreuse   = 0x7FFF00;
const uint32_t brown    = 0x503000, cyberyellow   = 0xFFD300, orange     = 0xFF8000; 
const uint32_t yellow   = 0xFFFF00, cadmiumyellow = 0xFFF600, dyellow    = 0xFFAA00, chromeyellow = 0xFFA700;
const uint32_t green    = 0x00FF00, brightgreen   = 0x66FF00, apple      = 0x80FF00, grass        = 0x00FF80;  
const uint32_t amaranth = 0xE52B50, edamaranth    = 0xFF0050, amber      = 0xFF7E00;
const uint32_t marine   = 0x0080FF, darkviolet    = 0x800080, pink       = 0xFF0080, purple       = 0xFF00FF; 
const uint32_t blue     = 0x0000FF, cerulean      = 0x007BA7, sky        = 0x00FFFF, capri        = 0x00BFFF;
const uint32_t edviolet = 0X7500BC, frenchviolet  = 0X8806CE, coquelicot = 0xFF3800;
const uint32_t greenblue= 0x00F2A0, hotmagenta    = 0xFF00BF, dodgerblue = 0x0073FF, screamingreen= 0x70FF70;
      uint32_t white    = 0xFFFFFF, lgray         = 0x666666, wgray      = 0xAAAAAA;
      uint32_t gray     = 0x333333, dgray         = 0x222222; 

//--------------------------------------------                                                //
// LED
//--------------------------------------------
extern const uint32_t NUM_LEDS;
const byte BRIGHTNESS =  16;                                                               // Initial brightness of the strips at startup BRIGHTNESS 0 - 255

                      #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
EdSoftLED LEDstrip ;//    = EdSoftLED();                                                      // Use EdSoftLED with ESP32 compiler V3.x.x. Neopixel crashes
EdSoftLED LED6812strip = EdSoftLED(NUM_LEDS, LED_PIN, SK6812WRGB);
EdSoftLED LED2812strip = EdSoftLED(NUM_LEDS, LED_PIN, WS2812RGB);
                      #else
// LED_PIN = 8;  // bug in Neopixel library. Does not translate D5 to GPIO 8
Adafruit_NeoPixel LEDstrip;
Adafruit_NeoPixel LED6812strip = Adafruit_NeoPixel(NUM_LEDS, 8, NEO_GRBW + NEO_KHZ800);       // NEO_RGBW
Adafruit_NeoPixel LED2812strip = Adafruit_NeoPixel(NUM_LEDS, 8, NEO_GRB  + NEO_KHZ800);       // NEO_RGB NEO_GRB
                      #endif

int      ProgressLedNr = 0;                                                                   // Startup Progress LED number
uint32_t MINColor      = chromeyellow;
uint32_t SECColor      = chromeyellow;  
                                             #ifdef FOURLANGUAGECLOCK
uint32_t DefaultColor  = white;   
uint32_t LetterColor   = white; 
uint32_t UKLetterColor = green;   
uint32_t DELetterColor = red;
uint32_t FRLetterColor = yellow;
uint32_t UKDefaultColor= UKLetterColor;
uint32_t DEDefaultColor= DELetterColor;
uint32_t FRDefaultColor= FRLetterColor;
                                             #else
uint32_t DefaultColor  = chromeyellow;   
uint32_t LetterColor   = chromeyellow;   
                                             #endif //FOURLANGUAGECLOCK

