ednieuw/NanoESP32-BW-RGBW-clock/ESP32WordClockUltimatePCB_V032/ESP32WordClockUltimatePCB_V032.ino
//----------------------------------------
// WIFI and webserver
//----------------------------------------
#define NOT_SET       0
#define SET           1
#define SET_AND_OK    2
#define IN_AP_NOT_SET 3
bool SSIDandNetworkfound = false;                                                             // True if Mem.SSID and a found WIFI.scan'ed network are identical
bool WIFIwasConnected = false;                                                                // Is WIFI connected?
bool apMode = false;
bool apModeTrigger = false;
const char* AP_SSID = "StartWordclock";
const char* AP_PASSWORD = "wordclock";
AsyncWebServer server(80);                                                                    // For OTA Over the air uploading
DNSServer dnsServer;
#include "Webpage.h"                                                                          // The Clock web page
#include "SoftAP.h"                                                                           // The web page to enter SSID and password of the WIFI router 


//--------------------------------------------                                                //
// NTP #include <ESPNtpClient.h>
//--------------------------------------------
boolean syncEventTriggered = false;                                                           // True if a time even has been triggered
NTPEvent_t ntpEvent;                                                                          // Last triggered event

//--------------------------------------------                                                //
// Common
//--------------------------------------------
#define MAXTEXT 255
bool      SerialConnected      = true;   
bool      LEDsAreOff           = false;                                                       // If true LEDs are off except time display
bool      NoTextInLeds         = false;                                                       // Flag to control printing of the text in function ColorLeds() and ShiftInTime()
byte      Toggle_HetWasIs      = 1;  
char      sptext[MAXTEXT];                                                                    // For common print use 
int       Previous_LDR_read    = 512;                                                         // The actual reading from the LDR + 4x this value /5
uint16_t  MilliSecondValue     = 10;                                                          // The duration of a second  minus 1 ms. Used in Demo mode
uint64_t  Loopcounter          = 0;
struct    EEPROMstorage {                                                                    // Data storage in EEPROM to maintain them after power loss
  byte DisplayChoice    = 0;
  byte TurnOffLEDsAtHH  = 0;
  byte TurnOnLEDsAtHH   = 0;
  byte LanguageChoice   = 0;
  byte LightReducer     = 0;
  int  LowerBrightness  = 0;
  int  UpperBrightness  = 0;
  int  NVRAMmem[24];                                                                          // LDR readings
  byte BLEOn            = 1;
  byte NTPOn            = 1;
  byte WIFIOn           = 1;  
  byte StatusLEDOn      = 1;
  int  ReconnectWIFI    = 0;                                                                  // No of times WIFI reconnected 
  byte DCF77On          = 0;
  byte UseRotary        = 0;                                                                  // Use coding for Rotary encoder ==1 or 3x1 membrane keypad ==2
  byte UseDS3231        = 0;                                                                  // Use the DS3231 time module 
  byte LEDstrip         = 0;                                                                  // 0 = SK6812 LED strip. 1 = WS2812 LED strip
  byte FiboChrono       = 0;                                                                  // true = Fibonacci, false = chrono clock display
  byte NoExUl           = 0;                                                                  // 0 = Normal, 1 = Extreme, 2 = Ultimate display of colours
  int  WIFIcredentials  = 0;                                                                  // Status of the WIFI connection. SSID&PWD set or in AP mode
  int  IntFuture2       = 0;                                                                  // For future use
  int  IntFuture3       = 0;                                                                  // For future use
  int  IntFuture4       = 0;                                                                  // For future use   
  byte UseBLELongString = 0;                                                                  // Send strings longer than 20 bytes per message. Possible in IOS app BLEserial Pro 
  uint32_t OwnColour    = 0;                                                                  // Self defined colour for clock display
  uint32_t DimmedLetter = 0;
  uint32_t BackGround   = 0;
  char SSID[30];                                                                              // 
  char Password[40];                                                                          // 
  char BLEbroadcastName[30];                                                                  // Name of the BLE beacon
  char Timezone[50];
  int  Checksum        = 0;
}  Mem; 
//--------------------------------------------                                                //
// Menu
//0        1         2         3         4
//1234567890123456789012345678901234567890----  
 char menu[][40] = {
 "A SSID B Password C BLE beacon name",
 "D Date (D15012021) T Time (T132145)",
 "E Timezone  (E<-02>2 or E<+01>-1)",
 "F Own colour  (Hex FWWRRGGBB)",
 "G Scan WIFI networks",
 "H Toggle use rotary encoder", 
 "I To print this Info menu",
 "J Use DS3231 RTC toggle On/Off",
                       #ifdef DCF77MOD
 "JJ Toggle use DCF77 receiver",
                       #endif //DCF77MOD
 "K LDR reads/sec toggle On/Off", 
 "N Display off between Nhhhh (N2208)",
 "O Display toggle On/Off",
 "P Status LED toggle On/Off", 
                       #ifdef RGBCLOCK
 "Q Display colour choice",
 "  Q0 Yellow  Q1 Hourly  Q2 White",
 "  Q3 All Own Q4 Own     Q5 Wheel",
                      #endif //RGBCLOCK
                      #ifdef NL144CLOCK
 "  Q6 Digital",
                      #endif //NL144CLOCK                      
 "R Reset settings @ = Reset MCU",
 "U Demo mode (msec) (M200)",
 "--Light intensity settings (1-250)--",
 "S Slope, L Min, M Max, (S80 L5 M200)",
 "W WIFI, X NTP&, CCC BLE, + Fast BLE",
 "# Self test, ! See RTC, & Update RTC",
 "Ed Nieuwenhuys january 2025" };
 

                      #ifdef RGBCLOCK
#include "RGBWclock.h"
                      #endif
                      #ifdef BWCLOCK  
#include "BWclock.h"
                      #endif


//  -------------------------------------   End Definitions  ---------------------------------------

//--------------------------------------------                                                //
// ARDUINO Setup
//--------------------------------------------
void setup() 
{
 Serial.begin(115200);                                                                        // Setup the serial port to 115200 baud //
 pinMode(LEDClockPin,  OUTPUT);                                                               // HC595 8-Bit Shift Registers
 pinMode(LEDDataPin,   OUTPUT);                                                               // HC595 8-Bit Shift Registers
 pinMode(LEDStrobePin, OUTPUT);                                                               // HC595 8-Bit Shift Registers
 SetStatusLED(0,0,10);                                                                         // Set the status LED to red
 Previous_LDR_read = ReadLDR();                                                               // Set the initial LDR reading
 int32_t Tick = millis();  
 while (!Serial)  
 {if ((millis() - Tick) >5000) break;}  Tekstprintln("Serial started");                       // Wait max 5 seconds until serial port is started   
 if(Mem.UseRotary==1)  InitRotaryMod(); Tekstprintln("Rotary available");                     // Start the Rotary encoder
 if(Mem.UseRotary==2)  InitKeypad3x1(); Tekstprintln("Keypad available");                     // Start the Keypad 3x1 
 SetStatusLED(0,10,0);
 Wire.begin();                                                                                // Keep this close to the first start to avoid WireTimeout()
 InitDS3231Mod();                       Tekstprintln("DS3231 RTC software started");          // Start the DS3231 RTC-module even if not installed. It can be turned it on later in the menu
 InitStorage();                         Tekstprintln("Stored settings loaded");               // Load settings from storage and check validity 
 StartLeds();                           Tekstprintln("LED strip started");                    // LED RainbowCycle
 if(Mem.BLEOn) { StartBLEService();     Tekstprintln("BLE started"); }                        // Start BLE service
 SetStatusLED(0,0,10);
 if(Mem.WIFIOn && CheckforWIFINetwork() ){ConnectWIFI(); Tekstprintln("WIFI started");}       // Start WIFI and optional NTP if Mem.WIFIOn = 1 
 if(Mem.DCF77On){StartDCF77();          Tekstprintln("DCF77 started");   }                    // Start DCF77
 GetTijd(true);                         Tekstprintln("");                                     // Get the time and print it
 Displaytime();                         Tekstprintln("");                                     // Print the tekst time in the display 
 SWversion();                                                                                 // Print the menu + version 
 SetStatusLED(10,0,0);                                                                        // Set the status LED to red                                  
 msTick = millis();                                                                           // start the seconds loop counter
} 

//--------------------------------------------                                                //
// ARDUINO Loop
//--------------------------------------------
void loop() 
{
 Loopcounter++;
 if (Demo)          Demomode();
 else               EverySecondCheck();                                                        // Let the second led tick and run the clock program                                                                        // For Over The Air updates This loop block is necessary for ElegantOTA to handle reboot after OTA update.
CheckDevices();
}
//--------------------------------------------                                                //
// COMMON Check connected input devices
//--------------------------------------------
void CheckDevices(void)
{
 CheckBLE();                                                                                  // Something with BLE to do?
 NTPsyncEvent();                                                                              // Check for NTP events
 SerialCheck();                                                                               // Check serial port every second 
 ElegantOTA.loop();                                                                           // For Over The Air updates This loop block is necessary for ElegantOTA to handle reboot after OTA update.
 if (Mem.UseRotary==1) RotaryEncoderCheck(); 
 if (Mem.UseRotary==2) Keypad3x1Check();
                                  #ifdef DCF77MOD
 if(UseDCF)  DCF77Check();
                                  #endif  //DCF77MOD                               
                                  #ifdef ONEWIREKEYPAD3x4   
 OnewireKeypad3x4Check(); 
                                  #endif  //ONEWIREKEYPAD3x4
                                  #ifdef ONEWIREKEYPAD3x1   
 OnewireKeypad3x1Check(); 
                                  #endif  //ONEWIREKEYPAD3x1
}
//--------------------------------------------                                                //
// COMMON Update routine done every second
//--------------------------------------------
void EverySecondCheck(void)
{
 static int Toggle = 0;
 uint32_t msLeap = millis() - msTick;                                                         // 
 if (msLeap >999)                                                                             // Every second enter the loop
 {
  msTick = millis();
  GetTijd(false);                                                                             // Get the time for the seconds 
  Toggle = 1-Toggle;                                                                           // Used to turn On or Off Leds
  UpdateStatusLEDs(Toggle);
                       #ifdef RGBCLOCK
  static uint8_t HC595value = 0;                                                              //                      
  HC595bank(HC595value);                                                                      // Option to run to LEDs on the shiftregisters every second
  if(++HC595value >= 24) HC595value = 0;                                                      // Let the HC595 shiftregister shift on one pin of the 24 
  SetSecondColour();                                                                          // Set the colour per second of 'IS' and 'WAS' 
                       #endif
  DimLeds(TestLDR);                                                                           // Every second an intensitiy check and update from LDR reading 
  if (timeinfo.tm_min != lastminute) EveryMinuteUpdate();                                     // Enter the every minute routine after one minute; 
  Loopcounter=0;
 }  
}

//--------------------------------------------                                                //
// COMMON Update routine done every minute
//-------------------------------------------- 
void EveryMinuteUpdate(void)
{   
 lastminute = timeinfo.tm_min; 
 if(Mem.WIFIOn && WIFIwasConnected)                                                                               // If WIFI switch is On.
   {
    if(WiFi.localIP()[0] == 0)
       {
        if(WIFIwasConnected)  WiFi.reconnect();                                                 // If connection lost and WIFI is used reconnect
        if(CheckforWIFINetwork(false) && !WIFIwasConnected) StartWIFI_NTP();                    // If there was no WIFI at start up start a WIFI connection  
        if(WiFi.localIP()[0] != 0) 
          {
          sprintf(sptext, "Reconnected to IP address: %d.%d.%d.%d", WiFi.localIP()[0], WiFi.localIP()[1], WiFi.localIP()[2], WiFi.localIP()[3] );
          Tekstprintln(sptext);
          }
        }
   } 
 GetTijd(false);
 Displaytime();                                                                               //PrintRTCTime();
 DimLeds(true);   
 if(timeinfo.tm_hour != lasthour) EveryHourUpdate();
}
//--------------------------------------------                                                //
// COMMON Update routine done every hour
//--------------------------------------------
void EveryHourUpdate(void)
{
 lasthour = timeinfo.tm_hour;
 //if (!Mem.StatusLEDOn) SetStatusLED(0,0,0);                                                // If for some reason the LEDs are ON and after a MCU restart turn them off.  
 if( (timeinfo.tm_hour == Mem.TurnOffLEDsAtHH) && (Mem.TurnOffLEDsAtHH != Mem.TurnOnLEDsAtHH))
       { LEDsAreOff = true;  ClearScreen(); }                                                 // Is it time to turn off the LEDs?
 if(timeinfo.tm_hour == Mem.TurnOnLEDsAtHH) 
   { 
    LEDsAreOff = false;
    lastminute = 99;                                                                          // Force a minute update
    Displaytime();  
   } 
 Mem.NVRAMmem[lasthour] =(byte)((SumLDRreadshour / NoofLDRreadshour?NoofLDRreadshour:1));     // Update the average LDR readings per hour
 SumLDRreadshour  = 0;
 NoofLDRreadshour = 0;
 if (timeinfo.tm_mday != lastday) EveryDayUpdate();  
}
//--------------------------------------------                                                //
// COMMON Update routine done every day
//--------------------------------------------
void EveryDayUpdate(void)
{
 if(timeinfo.tm_mday != lastday) 
   {
    lastday           = timeinfo.tm_mday; 
    Previous_LDR_read = ReadLDR();                                                            // to have a start value
    MinPhotocell      = Previous_LDR_read;                                                    // Stores minimum reading of photocell;
    MaxPhotocell      = Previous_LDR_read;                                                    // Stores maximum reading of photocell;
//    Mem.ReconnectWIFI = 0;                                                                    // Reset WIFI reconnection counter     
//    StoreStructInFlashMemory();                                                             // 
    }
}

//--------------------------------------------                                                //
// COMMON Update routine for the status LEDs
//-------------------------------------------- 
void UpdateStatusLEDs(int Toggle)
{
 if(Mem.StatusLEDOn)   
   {
    SetStatusLED((Toggle && WiFi.localIP()[0]==0) * 20, (Toggle && WiFi.localIP()[0]!=0) * 20 , (Toggle && deviceConnected) * 20); 
    SetPCBLED12( Toggle * 15);                                                                // links
    SetPCBLED10((1-Toggle) * 5);                                                              // rechts
    SetNanoLED13((1-Toggle) * 20);     
   }
   else
   {
    SetStatusLED(0, 0, 0); 
    SetPCBLED12(0);                                                                           //
    SetPCBLED10(0);                                                                           //
    SetNanoLED13(0);      
   }
}
//--------------------------------------------                                                //
// COMMON Control the RGB LEDs on the Nano ESP32
// Analog range 0 - 512. 0 is LED On max intensity
// 512 is LED off. Therefore the value is subtracted from 512 
//--------------------------------------------
void SetStatusLED(int Red, int Green, int Blue)
{
 analogWrite(LED_RED,   512 - Red);                                                                 // !Red (not Red) because 1 or HIGH is LED off
 analogWrite(LED_GREEN, 512 - Green);
 analogWrite(LED_BLUE,  512 - Blue);
}
//--------------------------------------------                                                //
// COMMON Control orange LED D13 on the Arduino 
//--------------------------------------------
void SetNanoLED13(int intensity) {analogWrite(secondsPin, intensity);}
//--------------------------------------------                                                //
// COMMON Control the RGB LED on the PCB
//--------------------------------------------
void SetPCBLED12(int intensity) {analogWrite(PCB_LED_D12, intensity);}
void SetPCBLED10(int intensity) {analogWrite(PCB_LED_D10, intensity);}

//--------------------------------------------                                                //
// COMMON check for serial input
//--------------------------------------------
void SerialCheck(void)
{
 String SerialString =""; 
 while (Serial.available())
    { 
     char c = Serial.read();                                                                  // Serial.write(c);
     if (c>31 && c<128) SerialString += c;                                                    // Allow input from Space - Del
     else c = 0;                                                                              // Delete a CR
    }
 if (SerialString.length()>0) 
    {
     ReworkInputString(SerialString);                                                         // Rework ReworkInputString();
     SerialString = "";
    }
}

