ednieuw/NanoESP32-BW-RGBW-clock/ESP32WordClockUltimatePCB_V032/ESP32WordClockUltimatePCB_V032.ino
// Can be used as alternative
//  SPIFFS
//  File myFile = SPIFFS.open("/MemStore.txt", FILE_WRITE);
//  myFile.write((byte *)&Mem, sizeof(Mem));
//  myFile.close();
 }
//--------------------------------------------                                                //
// COMMON Get data from FlashStorage
// Preferences.h
//--------------------------------------------
void GetStructFromFlashMemory(void)
{
 FLASHSTOR.begin("Mem", false);
 FLASHSTOR.getBytes("Mem", &Mem, sizeof(Mem) );
 FLASHSTOR.end(); 

// Can be used as alternative if no SD card
//  File myFile = SPIFFS.open("/MemStore.txt");  FILE_WRITE); myFile.read((byte *)&Mem, sizeof(Mem));  myFile.close();

 sprintf(sptext,"Mem.Checksum = %d",Mem.Checksum);Tekstprintln(sptext); 
}

//--------------------------------------------                                                //
// COMMON Version info
//--------------------------------------------
void SWversion(void) 
{ 
 #define FILENAAM (strrchr(__FILE__, '\\') ? strrchr(__FILE__, '\\') + 1 : __FILE__)
 html_info[0] = 0;                                                                           // Empty the info web page to be used in void WTekstprintln() 
 PrintLine(35);
 for (uint8_t i = 0; i < sizeof(menu) / sizeof(menu[0]); WTekstprintln(menu[i++]));
 PrintLine(35);
 sprintf(sptext,"Display off between: %02dh - %02dh",Mem.TurnOffLEDsAtHH, Mem.TurnOnLEDsAtHH);  WTekstprintln(sptext);
                        #ifdef RGBCLOCK
 byte dp = Mem.DisplayChoice;                        
  sprintf(sptext,"Display choice: %s",dp==0?"Yellow":dp==1?"Hourly":dp==2?"White":
              dp==3?"All Own":dp==4?"Own":dp==5?"Wheel":dp==6?"Digital":dp==7?"Analog":"NOP");  WTekstprintln(sptext);
                       #endif //RGBCLOCK                                                                                             
 sprintf(sptext,"Slope: %d     Min: %d     Max: %d ",
                 Mem.LightReducer, Mem.LowerBrightness,Mem.UpperBrightness);                   WTekstprintln(sptext);
 sprintf(sptext,"SSID: %s", Mem.SSID);                                                         WTekstprintln(sptext); 
// sprintf(sptext,"Password: %s", Mem.Password);                                               WTekstprintln(sptext);
 sprintf(sptext,"BLE name: %s", Mem.BLEbroadcastName);                                         WTekstprintln(sptext);
 sprintf(sptext,"IP-address: %d.%d.%d.%d/update", WiFi.localIP()[0], WiFi.localIP()[1], 
                                                  WiFi.localIP()[2], WiFi.localIP()[3] );      WTekstprintln(sptext);
 sprintf(sptext,"Timezone:%s", Mem.Timezone);                                                  WTekstprintln(sptext); 
 sprintf(sptext,"%s %s %s %s", Mem.WIFIOn?"WIFI=On":"WIFI=Off", 
                               Mem.NTPOn? "NTP=On":"NTP=Off",
                               Mem.BLEOn? "BLE=On":"BLE=Off",
                               Mem.UseBLELongString? "FastBLE=On":"FastBLE=Off" );             WTekstprintln(sptext);
char fftext[20];              
 sprintf(fftext,"%s", Mem.UseDS3231? " DS3231=On":" DS3231=Off"); 
 sprintf(sptext,"%s %s",Mem.UseRotary==0 ?"Rotary=Off Membrane=Off":
                        Mem.UseRotary==1 ?"Rotary=On Membrane=Off":
                        Mem.UseRotary==2 ?"Rotary=Off Membrane On":"NOP",fftext);               WTekstprintln(sptext);                            
 sprintf(sptext,"%s strip with %d LEDs (switch %%)", 
                 Mem.LEDstrip==0?"SK6812":Mem.LEDstrip==1?"WS2812":"NOP",NUM_LEDS);             WTekstprintln(sptext); 
 sprintf(sptext,"Software: %s",FILENAAM);                                                       WTekstprintln(sptext);  // VERSION);
 sprintf(sptext,"ESP32 Arduino core version: %d.%d.%d", 
          ESP_ARDUINO_VERSION_MAJOR,ESP_ARDUINO_VERSION_MINOR,ESP_ARDUINO_VERSION_PATCH);       WTekstprintln(sptext);
 PrintRTCTime();                                                                                
 PrintLine(35);                                                                               //
 }
//--------------------------------------------                                                //
// COMMON PrintLine
//--------------------------------------------
void PrintLine(byte Lengte)
{
 for(int n=0; n<Lengte; n++) sptext[n]='_';
 sptext[Lengte] = 0;
 WTekstprintln(sptext);
 sptext[0] = 0;
}

//--------------------------------------------                                                //
//  COMMON Input from Bluetooth or Serial
//--------------------------------------------
void ReworkInputString(String InputString)
{
 if(InputString.length()> 40){Serial.printf("Input string too long (max40)\n"); return;}      // If garbage return
 InputString.trim();                                                                          // Remove CR, LF etc.
 sptext[0] = 0;             
 if(InputString[0] > 31 && InputString[0] <127)                                               // Does the string start with a letter?
  { 
  switch (InputString[0])
   {
    case 'A':
    case 'a': 
            if (InputString.length() >4 && InputString.length() <30)
            {
             InputString.substring(1).toCharArray(Mem.SSID,InputString.length());
             sprintf(sptext,"SSID set: %s", Mem.SSID);  
            }
            else sprintf(sptext,"**** Length fault. Use between 4 and 30 characters ****");
            break;
    case 'B':
    case 'b': 
             if (InputString.equals("BBBB"))                                                 // 
               {   
                sprintf(sptext,"%s,**** Length fault. Use between 5 and 40 characters ****",Mem.Password);
                break;
               } 
             if (InputString.length() >4 && InputString.length() <40)
              {  
               InputString.substring(1).toCharArray(Mem.Password,InputString.length());
               sprintf(sptext,"Password set: %s\n Enter @ to reset ESP32 and connect to WIFI and NTP\n WIFI and NTP are turned ON", Mem.Password); 
               Mem.NTPOn        = 1;                                                          // NTP On
               Mem.WIFIOn       = 1;                                                          // WIFI On  
              }
             else sprintf(sptext,"**** Length fault. Use between 5 and 40 characters ****");
             break;  
    case 'C':
    case 'c':  
             if (InputString.equalsIgnoreCase("ccc"))                                         // Toggle BLE ON or OFF
               {   
                Mem.BLEOn = 1 - Mem.BLEOn; 
                sprintf(sptext,"BLE is %s after restart", Mem.BLEOn?"ON":"OFF" );
               }                       
              if (InputString.length() >4 && InputString.length() <30 )
              {  
               InputString.substring(1).toCharArray(Mem.BLEbroadcastName,InputString.length());
               sprintf(sptext,"BLE broadcast name set: %s", Mem.BLEbroadcastName); 
               Mem.BLEOn = 1;                                                                   // BLE On
              }
             else sprintf(sptext,"**** Length fault. Use between 4 and 29 characters ****");
             break;      
    case 'D':
    case 'd':  
             if (InputString.length() == 9 )
              {
               timeinfo.tm_mday = (int) SConstrainInt(InputString,1,3,0,31);
               timeinfo.tm_mon  = (int) SConstrainInt(InputString,3,5,0,12) - 1; 
               timeinfo.tm_year = (int) SConstrainInt(InputString,5,9,2000,9999) - 1900;
               if (DS3231Installed)
                 {
                  sprintf(sptext,"Time set in external RTC module");  
                  SetDS3231Time();
                  PrintDS3231Time();
                 }
               else sprintf(sptext,"No external RTC module detected");
               }            
            else sprintf(sptext,"****\nLength fault. Enter Dddmmyyyy\n****");
            break;
    case 'E':
    case 'e':  
             if (InputString.length() >2 )
               {  
                InputString.substring(1).toCharArray(Mem.Timezone,InputString.length());
                sprintf(sptext,"Timezone set: %s", Mem.Timezone); 
               }
             else sprintf(sptext,"**** Length fault. Use more than 2 characters ****");
             break;  
    case 'F':
    case 'f':  
             if (InputString.length() == 9 )
               {
                LetterColor = Mem.OwnColour = HexToDec(InputString.substring(1,9));           // Display letter color 
                sprintf(sptext,"Font colour stored: 0X%08X", Mem.OwnColour);
                Tekstprintln("**** Own colour changed ****");    
                LedsOff(); 
                Displaytime();
               }
             else sprintf(sptext,"****Length fault. Enter Frrggbb hexadecimal (0 - F)****\nStored: 0X%08X", Mem.OwnColour);              
             break;
    case 'G':
    case 'g':
             if (InputString.length() == 1) 
               {
                ScanWIFI(); 
                if(WIFIwasConnected)  WiFi.reconnect();
               }
             else sprintf(sptext,"**** Length fault. Enter G ****");            
             break;
    case 'H':
    case 'h':
             if (InputString.length() == 4)
               {   
                Mem.UseRotary = (byte) SConstrainInt(InputString,1,0,2);   // 
                if(Mem.UseRotary >2) Mem.UseRotary = 0; 
                sprintf(sptext,"\nUse of rotary encoder is %s\nUse of membrane keypad is %s", Mem.UseRotary==1?"ON":"OFF",Mem.UseRotary==2?"ON":"OFF" );
               }                                
             else sprintf(sptext,"**** Fault. Enter H000 (none), H001 (Rotary) or H002 (Membrane) ****\nUse rotary encoder is %s\nUse membrane keypad %s",Mem.UseRotary==1?"ON":"OFF",Mem.UseRotary==2?"ON":"OFF" );
             break;                       
    case 'I':
    case 'i': 
            SWversion();
            break;
    case 'J':
    case 'j':
             sprintf(sptext,"**** Length fault. Enter J or JJ ****");
             if (InputString.length() == 1)
               {   
                Mem.UseDS3231 = 1 - Mem.UseDS3231; 
                sprintf(sptext,"Use DS3231 is %s", Mem.UseDS3231?"ON":"OFF" );
               } 
             if (InputString.length() == 2 && InputString[1] =='J')  // JJ must be entered
              {
               UseDCF = 1 - UseDCF;
               sprintf(sptext,"Use DCF-receiver: %s",UseDCF ? "Yes" : "No");
              }                                 
             break; 
    case 'K':
    case 'k':
             TestLDR = 1 - TestLDR;                                                           // If TestLDR = 1 LDR reading is printed every second instead every 30s
             sprintf(sptext,"TestLDR: %s \nLDR reading, min and max of one day, %%Out, loops per second and time",TestLDR? "On" : "Off");
             break;      
    case 'L':
    case 'l':  
             if (InputString.length() > 1 &&  InputString.length() < 5)
               {      
                Mem.LowerBrightness = (byte) SConstrainInt(InputString,1,0,255);
                sprintf(sptext,"Lower brightness: %d bits",Mem.LowerBrightness);
               }
             else sprintf(sptext,"**** Input fault. \nEnter Lnnn where n between 1 and 255");               
             break;   
    case 'M':                                                                                 // factor to multiply brighness (0 - 255) with 
    case 'm':
            if (InputString.length() > 1 &&  InputString.length() < 5)
               {    
                Mem.UpperBrightness = SConstrainInt(InputString,1,1,255);
                sprintf(sptext,"Upper brightness changed to: %d bits",Mem.UpperBrightness);
               }
            else sprintf(sptext,"**** Input fault. \nEnter Mnnn where n between 1 and 255");
              break;     
    case 'N':
    case 'n':
             sprintf(sptext,"**** Length fault N. ****");    
             if (InputString.length() == 1 )         Mem.TurnOffLEDsAtHH = Mem.TurnOnLEDsAtHH = 0;
             if (InputString.length() == 5 )
              {
               Mem.TurnOffLEDsAtHH =(byte) InputString.substring(1,3).toInt(); 
               Mem.TurnOnLEDsAtHH  =(byte) InputString.substring(3,5).toInt(); 
              }
             Mem.TurnOffLEDsAtHH = _min(Mem.TurnOffLEDsAtHH, 23);
             Mem.TurnOnLEDsAtHH  = _min(Mem.TurnOnLEDsAtHH, 23); 
             sprintf(sptext,"Display is OFF between %2d:00 and %2d:00", Mem.TurnOffLEDsAtHH,Mem.TurnOnLEDsAtHH );
             break;
    case 'O':
    case 'o':
             sprintf(sptext,"**** Length fault O. ****");
             if(InputString.length() == 1)
               {
                LEDsAreOff = !LEDsAreOff;
                sprintf(sptext,"Display is %s", LEDsAreOff?"OFF":"ON" );
                if(LEDsAreOff) { ClearScreen();}                                              // Turn the display off
                else 
                {
                  Tekstprintln(sptext); 
                  lastminute = 99;
                  Displaytime();                                                              // Turn the display on   
                }
               }
             break;                                                                   
    case 'P':
    case 'p':  
             sprintf(sptext,"**** Length fault P. ****");  
             if(InputString.length() == 1)
               {
                Mem.StatusLEDOn = !Mem.StatusLEDOn;
                UpdateStatusLEDs(0);
                sprintf(sptext,"StatusLEDs are %s", Mem.StatusLEDOn?"ON":"OFF" );            // UpdateStatusLEDs(Toggle); in EverySecond() will turn On or Off the LEDs    
               }
             break;        
                       #ifdef RGBCLOCK
    case 'q':
    case 'Q':   
             sprintf(sptext,"**** Length fault Q. ****");   
             if (InputString.length() == 1 )
               {
             Tekstprintln("  Q0= Default colour");
             Tekstprintln("  Q1= Hourly colour");
             Tekstprintln("  Q2= All white");
             Tekstprintln("  Q3= All Own colour");
             Tekstprintln("  Q4= Own colour, HETISWAS changing");
             Tekstprint(  "  Q5= Wheel colour");
             Tekstprint(  "  Q6= Digital display");
             sptext[0]=0;
               }
             if (InputString.length() == 2 )
               {
                Mem.DisplayChoice = (byte) InputString.substring(1,2).toInt(); 
                if (Mem.DisplayChoice>6) Mem.DisplayChoice = 0;
                sprintf(sptext,"Display choice: Q%d", Mem.DisplayChoice);
                lastminute = 99;                                                              // Force a minute update
               }    
             //Displaytime();   
             break;
                       #endif //RGBCLOCK             
    case 'R':
    case 'r':
             sprintf(sptext,"**** Length fault R. ****");       
             if (InputString.equals("RRRRR"))                                                   // 
               { 
                ResetCredentials();  
                Reset();              
                ESP.restart();  
                break;
               }
             if (InputString.equals("RRR"))                                                   // 
               { 
                ResetCredentials(); 
                ESP.restart();  
                sprintf(sptext,"\nSSID and password deleted. \nWIFI, NTP and BLE is On\n Enter @ to restart");
                break;
               } 
             if (InputString.length() == 1)
               {   
                Reset();
                sprintf(sptext,"\nReset to default values: Done");
                lastminute = 99;                                                              // Force a minute update
                Displaytime();                                                                // Turn on the display with proper time
               }                                
             break;       
    case 'S':                                                                                 // Slope. factor ( 0 - 1) to multiply brighness (0 - 255) with 
    case 's':
             sprintf(sptext,"**** Length fault S. ****");    
             if (InputString.length() > 1 && InputString.length() < 5)
               {                
                Mem.LightReducer = (byte) SConstrainInt(InputString,1,1,255);
                sprintf(sptext,"Slope brightness changed to: %d%%",Mem.LightReducer);
               }
             else sprintf(sptext,"**** Input fault. \nEnter Snnn where n between 1 and 255");
             break;                    
    case 'T':
    case 't':
//                                                                                            //
             if(InputString.length() == 7)  // T125500
               {
                timeinfo.tm_hour = (int) SConstrainInt(InputString,1,3,0,23);
                timeinfo.tm_min  = (int) SConstrainInt(InputString,3,5,0,59); 
                timeinfo.tm_sec  = (int) SConstrainInt(InputString,5,7,0,59);
                if (DS3231Installed)
                  {
                   sprintf(sptext,"Time set in external RTC module");  
                   SetDS3231Time();
                   PrintDS3231Time();
                  }
                else sprintf(sptext,"No external RTC module detected");
               } 
             else sprintf(sptext,"**** Length fault. Enter Thhmmss ****");
             break; 
    case 'U':
    case 'u':
            sprintf(sptext,"**** Length fault U. Demo mode (Unnn or U) ****");
            if (InputString.length() == 1)
               {   
                Demo = false; 
                sprintf(sptext,"Demo mode: %s",Demo?"ON":"OFF"); 
               }
            if (InputString.length() >1 && InputString.length() < 6 )
              {
                MilliSecondValue = InputString.substring(1,5).toInt();                
                Demo = true;                                                                 // Toggle Demo mode
                sprintf(sptext,"Demo mode: %s MillisecondTime=%d",Demo?"ON":"OFF", MilliSecondValue); 
              }
             break;              
    case 'W':
    case 'w':
             if (InputString.length() == 1)
               {   
                Mem.WIFIOn = 1 - Mem.WIFIOn; 
                Mem.ReconnectWIFI = 0;                                                        // Reset WIFI reconnection counter 
                Mem.NTPOn = Mem.WIFIOn;                                                       // If WIFI is off turn NTP also off
                sprintf(sptext,"WIFI is %s after restart", Mem.WIFIOn?"ON":"OFF" );
               }                                
             else sprintf(sptext,"**** Length fault. Enter W ****");
             break; 
    case 'X':
    case 'x':
             if (InputString.length() == 1)
               {   
                Mem.NTPOn = 1 - Mem.NTPOn; 
                sprintf(sptext,"NTP is %s after restart", Mem.NTPOn?"ON":"OFF" );
               }                                
             else sprintf(sptext,"**** Length fault. Enter X ****");
             break; 
    case 'Y':
    case 'y':
             Play_Lights();
             lastminute = 99;                                                                // Force a minute update
             Displaytime(); 
             sprintf(sptext,"**** Play Lights");     
             break;    
    case 'Z':
    case 'z':
             sprintf(sptext,"**** Nothing done");     
             break;  
//--------------------------------------------                                                //        
     case '!':                                                                                // Print the NTP, RTC and DS3231 time
             if (InputString.length() == 1)  PrintAllClockTimes();
             break;       
    case '@':
             if (InputString.length() == 1)
               {   
                Tekstprintln("\n*********\n ESP restarting\n*********\n");
                ESP.restart();   
               }                                
             else sprintf(sptext,"**** Length fault. Enter @ ****");
             break;     
    case '#':
             if (InputString.length() == 1)
               {
                Zelftest = 1 - Zelftest; 
                sprintf(sptext,"Zelftest: %s", Zelftest?"ON":"OFF" ); 
                Selftest();   
                Displaytime();                                                                // Turn on the display with proper time
               }                                
             else sprintf(sptext,"**** Length fault. Enter # ****");
             break; 
    case '$':
             if (InputString.length() == 1)
               {   
                Mem.DCF77On = 1 - Mem.DCF77On; 
                sprintf(sptext,"DCF77 is %s after restart", Mem.DCF77On?"used":"NOT used" );
               }                                
             else sprintf(sptext,"**** Length fault. Enter $ ****");
             break; 
     case '%':
             if (InputString.length() == 1)
               {   
                Mem.LEDstrip = 1 - Mem.LEDstrip; 
                sprintf(sptext,"LED strip is %s after restart", Mem.LEDstrip?"WS2812":"SK6812" );
               }                                
             else sprintf(sptext,"**** Length fault percent. ****");
             break; 
//                                                                                            //             
    case '&':
             sprintf(sptext,"**** Length fault &. ****");                                     // Forced get NTP time and update the DS32RTC module
             if (InputString.length() == 1)
              {
               NTP.getTime();                                                                // Force a NTP time update  
               SetDS3231Time();
               SetRTCTime();    
               PrintAllClockTimes();
               } 
             break;                                                                           // Toggle DCF Signal on Display
    case '*':
            if (InputString.length() == 1)
              {
               SeeDCFsignalInDisplay = 1 - SeeDCFsignalInDisplay;
               sprintf(sptext,"SeeDCFsignal: %s",SeeDCFsignalInDisplay ? "Yes" : "No ");
               }
             break;
    case '+':                  
             if (InputString.length() == 1)
               {   
                Mem.UseBLELongString = 1 - Mem.UseBLELongString; 
                sprintf(sptext,"Fast BLE is %s", Mem.UseBLELongString?"ON":"OFF" );
               }                                
             else sprintf(sptext,"**** Length fault. Enter Z ****");
             break;                               
    case '0':
    case '1':
    case '2':        
             if (InputString.length() == 6)                                                    // For compatibility input with only the time digits
              {
               timeinfo.tm_hour = (int) SConstrainInt(InputString,0,2,0,23);
               timeinfo.tm_min  = (int) SConstrainInt(InputString,2,4,0,59); 
               timeinfo.tm_sec  = (int) SConstrainInt(InputString,4,6,0,59);
               if (DS3231Installed)
                 {
                  sprintf(sptext,"Time set in external RTC module");  
                  SetDS3231Time();
                  PrintDS3231Time();
                 }
               else sprintf(sptext,"No external RTC module detected");
               } 
    default: break;
    }
  }  
 Tekstprintln(sptext); 
 StoreStructInFlashMemory();                                                                                                          // Update EEPROM                                     
 InputString = "";
}


